<template>
  <div class="page_about__wrapper">
    <h2>Что делать?</h2>
    <p>
      Регистрируешься, заполняешь анкету и получаешь
      индивидуальные рекомендации возможных партнеров.
      Ты сам дожен решить - понравился ли тебе этот человек или нет.
      Если ты поставил ему лайк и он в ответ
      лайкнул тебя у вас образуется пара и открывается возможность отправить ему личное сообщение.
      Вы можете договориться о встречи или остаться виртуальными друзьями.
    </p>
    <h2>По какому принципу мне подбирают партнера?</h2>
    <p>
      Прежде всего мы подбираем тебе партнера по гендеру и ориентации.
      Ты указал ее при регистрации и можешь изменить в настройках в любой момент.
      Следующий фактор - мы стараемся подобрать партнера как можно ближе к тебе, если такое возможно
      . Так же мы не забываем учитывать твой рейтинг и рейтинг потенциальных партнеров,
      разницу в возрасте и элемент случайности.
    </p>
    <h2>Что такое рейтниг?</h2>
    <p>
      Рейтниг - это выдуманный показатель, который отображает то, на сколько ты популярен
      у других пользователей. Конечно же, мы не забываем о новых пользователях и так же поднимаем
      их в списке, что бы они могли получить свой рейтинг.
    </p>
  </div>
</template>

<script>
export default {

};
</script>

<style lang="scss">
  @import "@/assets/style/vars.scss";
  .page_about__wrapper {
    width: 80%;
    margin: 0 auto;
    margin-top: 50px;
    color: $white;
    font-weight: 600;
    h2 {
      margin-top: 50px;
      &:first-child {
        margin-top: 0;
      }
    }
  }
</style>
